content/notes/orgmode_mathmatics.org
:PROPERTIES:
:ID:       9d908aa4-c486-4793-b4d4-78c9a3a6ca08
:END:
#+title: Orgmode-mathmatics

* [[id:31075352-280e-4ef1-978e-5c189da43657][Org-mode]] Mathematics
The system is very similar to Latex.
** Mathematical symbols
To use mathematical symbols not on the general keyboard you start with a backslack "\" and then type the symbol you require.
For example: \beta \theta and \neq. These will be automatically converted to symbols on your screen one enabling some minor-mode (I completely forgor ☠ (old random Tiktok joke)).
*** Some you often need
*_* for the amount of a element
*\times* for times

** Export to HTML
When exporting to HTML, make sure you wrap the equation in "$"
For example:  $(x+5)^2$
You can see the changed if you turn on *org-toggle-pretty-entities*
** Tables
For now, I have no idea how to place margins on html/css tables cuz they are terrible.
Just add a \\ before the tables to force a line between them
