notes/orgmode_mathmatics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orgmode-mathmatics</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css2?family=JetBrains+Mono&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">

<div class='grid-container'>
  <div class='grid-item header'>

    <a href='https://www.haider.gq' class='Header_Title'>
      <span class='Header_Haider-Mirza'>Haider Mirza</span>
    </a>
    <ul class='Header_links'>
      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
    </ul>

    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Sidebar_Search'>
    </form>
  </div>

  <div class='grid-item main'>
    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Main_Search'>
    </form>
    <script src='https://www.haider.gq/base/search.js' crossorigin='anonymous'></script>
    <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Orgmode-mathmatics</h1>

<div id="outline-container-orge5f0d31" class="outline-2">
<h2 id="orge5f0d31"><a href="org_mode.html#ID-31075352-280e-4ef1-978e-5c189da43657">Org-mode</a> Mathematics</h2>
<div class="outline-text-2" id="text-orge5f0d31">
<p>
The system is very similar to Latex.
</p>
</div>
<div id="outline-container-org52fa1fc" class="outline-3">
<h3 id="org52fa1fc">Mathematical symbols</h3>
<div class="outline-text-3" id="text-org52fa1fc">
<p>
To use mathematical symbols not on the general keyboard you start with a backslack "\" and then type the symbol you require.
For example: &beta; &theta; and &ne;. These will be automatically converted to symbols on your screen one enabling some minor-mode (I completely forgor ☠ (old random Tiktok joke)).
</p>
</div>
<div id="outline-container-org6d47021" class="outline-4">
<h4 id="org6d47021">Some you often need</h4>
<div class="outline-text-4" id="text-org6d47021">
<p>
<b>_</b> for the amount of a element
<b>&times;</b> for times
</p>
</div>
</div>
</div>

<div id="outline-container-orga0f03e7" class="outline-3">
<h3 id="orga0f03e7">Export to HTML</h3>
<div class="outline-text-3" id="text-orga0f03e7">
<p>
When exporting to HTML, make sure you wrap the equation in "$"
For example:  \((x+5)^2\)
You can see the changed if you turn on <b>org-toggle-pretty-entities</b>
</p>
</div>
</div>
<div id="outline-container-org2f0ead5" class="outline-3">
<h3 id="org2f0ead5">Tables</h3>
<div class="outline-text-3" id="text-org2f0ead5">
<p>
For now, I have no idea how to place margins on html/css tables cuz they are terrible.
Just add a \\ before the tables to force a line between them
</p>
</div>
</div>
</div>

<div id="outline-container-org05887e2" class="outline-2">
<h2 id="org05887e2">Links to this note</h2>
<div class="outline-text-2" id="text-org05887e2">
<ul class="org-ul">
<li><a href="./org_mode.html">Orgmode</a></li>
<li><a href="./org_mode.html">Orgmode</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
